{
    "direction": "rtl",
    "footer": {
        "text": "HTMLtoHero هي منصة مخصصة لتعليم تطوير الويب من خلال دروس تدريجية وتمارين تفاعلية. تعلم HTML وCSS وJavaScript بطريقة سهلة وممتعة.",
        "copyright": "حقوق الطبع والنشر Cenin Rihavi 2025©"
    },
    "header": {
        "html": "HTML",
        "htmlTutorials": "دروس",
        "htmlExercises": "تمارين",
        "css": "CSS",
        "cssTutorials": "دروس",
        "cssExercises": "تمارين",
        "js": "جافاسكريبت",
        "jsTutorials": "دروس",
        "jsExercises": "تمارين",
        "codeEditor": "محرر الأكواد",
        "search": "بحث",
        "login": "تسجيل الدخول",
        "profile": "الملف الشخصي",
        "logout": "تسجيل الخروج"
    },
    "mainpage": {
        "discovercontainer": {
            "discover": "اكتشف",
            "search": "بحث"
        }
    },
    "notFoundPage": {
        "title": "HTMLtoHero - غير موجود",
        "errorText": "خطأ 404",
        "smallText": "الصفحة غير موجودة!"
    },
    "loginPage": {
        "email": "البريد الإلكتروني",
        "password": "كلمة المرور",
        "loginButton": "تسجيل الدخول",
        "createNewAccount": "إنشاء حساب جديد"
    },
    "profile": {
        "profileContainer": {
            "name": "الاسم",
            "birthday": "تاريخ الميلاد",
            "accountCreationDate": "تاريخ إنشاء الحساب",
            "level": "المستوى"
        },
        "learningContainer": {
            "continueLearning": "متابعة التعلم...",
            "html": "HTML",
            "css": "CSS",
            "js": "JS"
        },
        "exercisingContainer": {
            "continueExercising": "متابعة التمارين...",
            "html": "HTML",
            "css": "CSS",
            "js": "JS"
        }
    },
    "codeeditor": {
        "previewButton": "معاينة"
    },
    "htmlTutorials": {
        "markAsCompleted": "وضع علامة كمكتمل",
        "chapter1": {
            "page1": {
                "pageTitle": "ما هو HTML؟",
                "title1": "ما هو HTML؟",
                "paragraph1": "HTML، أو لغة ترميز النص التشعبي، هي حجر الأساس في تطوير الويب وعمود كل موقع ويب تزوره. إنها لغة موحدة تُستخدم لإنشاء وتنظيم محتوى صفحات الويب، مما يضمن أن المتصفحات مثل Chrome وFirefox وSafari يمكنها تفسير المحتوى وعرضه بشكل صحيح.",
                "title2": "لبنات بناء الويب",
                "paragraph2": "HTML ليست لغة برمجة - إنها لغة ترميز، مما يعني أنها تُستخدم لتعليق النصوص وتوفير تعليمات للمتصفحات حول كيفية عرض المحتوى. تأتي هذه التعليقات في شكل عناصر HTML، مكتوبة باستخدام علامات مثل <html> و<head> و<body>.",
                "paragraph3": "يوفر HTML الهيكل لجميع محتويات الويب. مع عناصر للعناوين والفقرات والصور والروابط وأكثر من ذلك، فإنه يعمل كنقطة انطلاق لكل مشروع ويب. من خلال دمج HTML مع CSS وJavaScript، يمكن للمطورين إنشاء مواقع ويب مذهلة بصريًا وتفاعلية.",
                "title3": "ماذا يمكن لـ HTML أن يفعل؟",
                "listTitle1": "يسمح لك HTML ببناء هيكل صفحات الويب عن طريق إضافة:",
                "list1Item1": "العناوين والفقرات: استخدم <h2> إلى <h6> للعناوين و<p> للفقرات لتنظيم المحتوى النصي.",
                "list1Item2": "الصور والوسائط المتعددة: قم بتضمين الصور والصوت والفيديو لتجربة مستخدم جذابة.",
                "list1Item3": "الروابط: استخدم علامات <a> للتنقل بين الصفحات والمواقع الخارجية.",
                "list1Item4": "القوائم: نظم المحتوى باستخدام قوائم مرتبة (<ol>) أو غير مرتبة (<ul>).",
                "list1Item5": "النماذج: اجمع مدخلات المستخدم باستخدام نماذج تفاعلية وحقول إدخال.",
                "paragraph4": "يدعم HTML أيضًا عناصر دلالية مثل <header> و<footer> و<article> لتحسين إمكانية الوصول وتحسين محركات البحث (SEO).",
                "title4": "لماذا تتعلم HTML؟",
                "listTitle2": "HTML هو أساس تطوير الويب، وتعلمه هو الخطوة الأولى نحو بناء مواقعك الخاصة. إليك لماذا هو ضروري:",
                "list2Item1": "سهولة التعلم: HTML بسيط ومناسب للمبتدئين.",
                "list2Item2": "التنوع: إنه نقطة البداية لجميع مشاريع الويب.",
                "list2Item3": "فرص العمل: فهم HTML يفتح الأبواب أمام أدوار متنوعة في تطوير وتصميم الويب.",
                "paragraph5": "تعلم HTML يشبه تعلم أبجدية تطوير الويب. يمنحك الأدوات لإحياء أفكارك عبر الإنترنت ويوفر أساسًا متينًا للغوص في تقنيات أكثر تقدمًا.",
                "title5": "تصور هيكل HTML",
                "title6": "الخلاصة",
                "paragraph6": "HTML أكثر من مجرد أداة تقنية؛ إنها اللغة التي تحيي الأفكار على الويب. سواء أردت إنشاء مدونة شخصية أو محفظة أو موقع ويب كامل، فإن إتقان HTML هو البوابة إلى إمكانيات لا نهائية. مع CSS وJavaScript، يصبح ثلاثيًا قويًا لبناء مواقع ويب حديثة وجذابة وديناميكية. لذا انغمس، جرب، وابدأ رحلتك نحو أن تصبح بطلًا في تطوير الويب!"
            }
        },
        "chapter2": {
            "page1": {
                "pageTitle": "فهم نوع المستند HTML <!DOCTYPE html>",
                "title1": "فهم نوع المستند HTML <!DOCTYPE html>",
                "paragraph1": "إعلان <!DOCTYPE> جزء مهم من أي مستند HTML. يجب أن يكون أول ما يظهر في مستند HTML، وهو يخبر متصفح الويب بأي إصدار من HTML يتوقعه. بدونه، قد يعرض المتصفح الصفحة بشكل غير صحيح، خاصة عند التبديل بين إصدارات HTML مختلفة.",
                "title2": "ما هو <!DOCTYPE html>؟",
                "paragraph2": "يُستخدم إعلان <!DOCTYPE html> لتحديد أن المستند هو مستند HTML5. يحدد نوع المستند وإصدار HTML المستخدم، ويضمن أن يعرض المتصفح الصفحة في الوضع القياسي، متجنبًا وضع التوافق القديم، حيث قد تستخدم المتصفحات طرقًا قديمة لعرض المحتوى.",
                "title3": "لماذا <!DOCTYPE html> مهم؟",
                "list1Item1": "عرض المتصفح: يساعد المتصفح على فهم إصدار HTML المتوقع. هذا يضمن عرض عناصر وميزات HTML الحديثة بشكل صحيح.",
                "list1Item2": "الوضع القياسي مقابل وضع التوافق: بدون <!DOCTYPE html>، قد تعرض بعض المتصفحات الصفحة في وضع التوافق، حيث قد لا تعمل التخطيطات والأنماط كما هو متوقع.",
                "list1Item3": "HTML5: مع HTML5، أصبح <!DOCTYPE html> أبسط من الإصدارات السابقة. في الإصدارات القديمة من HTML، مثل HTML 4.01، كان نوع المستند أطول ويتضمن المزيد من المعلومات. HTML5 بسّط هذا باستخدام <!DOCTYPE html> فقط.",
                "title4": "كيف تستخدم <!DOCTYPE html>؟",
                "paragraph3": "يجب أن يظهر الإعلان في بداية المستند تمامًا، قبل علامة <html>. هذه هي السطر الأول في مستند HTML الخاص بك.",
                "codeTitle1": "الهيكل الأساسي:",
                "listTitle2": "النقاط الرئيسية التي يجب تذكرها:",
                "list2Item1": "استخدم دائمًا <!DOCTYPE html> في أعلى مستند HTML الخاص بك.",
                "list2Item2": "يعلن أن المستند هو HTML5، وهو الإصدار الأحدث والأكثر استخدامًا لـ HTML.",
                "list2Item3": "<!DOCTYPE html> يساعد المتصفحات على تفسير الصفحة وعرضها بشكل صحيح."
            },
            "page2": {
                "pageTitle": "عناصر <html> و<head> و<body>",
                "title1": "عناصر <html> و<head> و<body>",
                "title2": "عنصر <html>",
                "paragraph1": "عنصر <html> هو العنصر الجذر لمستند HTML. يحتوي على كل محتوى الصفحة، بما في ذلك قسمي الرأس والجسم. يجب أن يبدأ كل مستند HTML بهذا العنصر، ويجب أن تكون جميع العناصر الأخرى متداخلة داخله.",
                "codeTitle1": "الصيغة:",
                "listTitle1": "يجب أن يحتوي عنصر <html> على قسمين رئيسيين:",
                "list1Item1": "قسم <head>: يحتوي على معلومات وصفية عن المستند، مثل العنوان، ترميز الأحرف، وروابط لموارد خارجية مثل ملفات CSS والسكربتات.",
                "list1Item2": "قسم <body>: يحتوي على المحتوى المرئي للصفحة، مثل النصوص والصور والفيديوهات وعناصر أخرى.",
                "title3": "عنصر <head>",
                "paragraph2": "يُستخدم عنصر <head> لاحتواء معلومات وصفية عن مستند HTML. لا يعرض أي محتوى على الصفحة نفسها، لكنه يوفر معلومات مهمة للمتصفح ومحركات البحث.",
                "listTitle2": "العناصر الشائعة داخل <head>:",
                "list2Item1": "<meta> يحدد البيانات الوصفية مثل ترميز الأحرف أو معلومات المؤلف.",
                "list2Item2": "<title> يحدد عنوان الصفحة، الذي يظهر في شريط عنوان المتصفح أو التبويب.",
                "list2Item3": "<link> يُستخدم لربط موارد خارجية، مثل أوراق الأنماط أو الأيقونات المفضلة.",
                "list2Item4": "<style> يحتوي على أنماط CSS داخلية للمستند.",
                "list2Item5": "<script> يحدد كود JavaScript خارجي أو مضمن.",
                "codeTitle2": "مثال:",
                "list3Item1": "<meta charset=\"UTF-8\"> يحدد ترميز الأحرف للمستند. UTF-8 هو الترميز الأكثر شيوعًا لصفحات الويب الحديثة، ويدعم مجموعة واسعة من الأحرف.",
                "list3Item2": "<meta name=\"author\" content=\"John Doe\"> يوفر معلومات عن مؤلف الصفحة، وهي غير مرئية عادةً للمستخدمين ولكنها قد تكون مفيدة لمحركات البحث.",
                "list3Item3": "<title> المحتوى داخل علامة <title> يظهر في تبويب المتصفح.",
                "title4": "عنصر <body>",
                "paragraph3": "عنصر <body> يحتوي على المحتوى الفعلي الذي سيكون مرئيًا للمستخدم. يشمل ذلك جميع العناصر مثل النصوص والعناوين والصور والروابط وعناصر HTML الأخرى.",
                "codeTitle3": "مثال:",
                "list4Item1": "<h1>: علامة <h1> تمثل العنوان الرئيسي في الصفحة.",
                "list4Item2": "<p>: علامة <p> تُستخدم لفقرة نصية.",
                "paragraph4": "كل ما هو داخل <body> هو ما يراه المستخدمون عند زيارة الصفحة.",
                "listTitle5": "النقاط الرئيسية التي يجب تذكرها:",
                "list5Item1": "عنصر <html> يغلف مستند HTML بأكمله، بما في ذلك قسمي الرأس والجسم.",
                "list5Item2": "عنصر <head> يحتوي على بيانات وصفية وروابط لموارد خارجية، مثل ملفات CSS والسكربتات، وعنوان المستند.",
                "list5Item3": "عنصر <body> يحتوي على المحتوى المرئي الذي يتفاعل معه المستخدمون، مثل العناوين والفقرات والصور والروابط."
            }
        }
    },
    "cssTutorials": {
        "markAsCompleted": "وضع علامة كمكتمل",
        "chapter1": {
            "page1": {
                "title1": "ما هو CSS؟",
                "paragraph1": "CSS تعني Cascading Style Sheets (أوراق الأنماط المتتالية). تُستخدم للتحكم في تخطيط وعرض صفحات الويب. باستخدام CSS، يمكنك تغيير اللون والخط والتباعد والمحاذاة وموضع عناصر HTML على صفحة الويب. يتيح CSS فصل هيكل المحتوى (HTML) عن عرضه (CSS)، مما يجعل تطوير الويب أكثر كفاءة وسهولة في الصيانة.",
                "paragraph2": "يوفر CSS طريقة لتصميم مستندات HTML الخاصة بك. يمكنك تطبيق الأنماط على الصفحة بأكملها، أو يمكنك استهداف عناصر فردية، مثل الفقرات والعناوين والروابط وغيرها.",
                "title2": "كيف يعمل CSS؟",
                "paragraph3": "يعمل CSS عن طريق اختيار عناصر HTML وتطبيق الأنماط عليها. تتكون قاعدة CSS من محدد (يحدد أي عناصر HTML سيتم تطبيق النمط عليها) وإعلان (يحدد الأنماط التي يجب تطبيقها).",
                "codeTitle1": "إليك مثالًا لقاعدة CSS بسيطة:",
                "smallTitle1": "في هذا المثال:",
                "paragraph4": "المحدد هو p، الذي يستهدف جميع عناصر <p> (الفقرة) في المستند.",
                "paragraph5": "الإعلانات موجودة داخل الأقواس المتعرجة {} وتحدد الأنماط التي سيتم تطبيقها. في هذه الحالة، يتم تعيين اللون إلى الأزرق وحجم الخط إلى 16 بكسل.",
                "title3": "لماذا تستخدم CSS؟",
                "list1Item1": "فصل الاهتمامات: يفصل CSS الهيكل (HTML) عن التصميم (CSS)، مما يجعل موقعك الإلكتروني أسهل في الإدارة والتحديث.",
                "list1Item2": "التوافق: باستخدام CSS، يمكنك ضمان تصميم متسق عبر جميع صفحات موقعك الإلكتروني.",
                "list1Item3": "الكفاءة: يتيح CSS لك التحكم في مظهر صفحات متعددة من موقع مركزي واحد، مما يجعل التغييرات أسرع وأسهل.",
                "codeTitle2": "مثال: دعونا ننظر إلى مثال حيث نطبق بعض أنماط CSS الأساسية على صفحة ويب.",
                "listTitle2": "في هذا المثال:",
                "list2Item1": "لون خلفية الصفحة تم تعيينه إلى الأزرق الفاتح.",
                "list2Item2": "العنوان <h1> له لون أزرق غامق ومتمركز.",
                "list2Item3": "الفقرة <p> لها نص رمادي غامق وحجم خط 18 بكسل."
            }
        }
    }
}